/* ммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммм
	File:		GTIMSYS.C

	Notes:		Timing system stuff needed by gtim

	Author:		G Robert Liddon @ 73b

	Copyright (C) 1996 DCI Ltd All rights reserved. 
  мммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммм */

#ifndef __GTIMSYS_H__
#define __GTIMSYS_H__

/* ддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд
	Includes
	дддддддд */

/*	Glib
	дддд */
#include "gtypes.h"

/* ддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд
	Defines
	ддддддд */

/* ддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд
	Typedefs
	дддддддд */

/* ддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд
	Enums
	ддддд */

/* ддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд
	Structures
	дддддддддд */

/* ддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд
	Supported Functions
	ддддддддддддддддддд */
#ifdef __cplusplus
extern "C" {
#endif

GLIB_API U32	GTIMSYS_InitTimer(void);
GLIB_API void	GTIMSYS_ResetTimer(void);
GLIB_API U32	GTIMSYS_GetTimer(void);

#ifdef __cplusplus
}
#endif

/* ддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд */
#endif
/* ддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд
	ends */

